[
  {
    "id": 1,
    "title": "Harry Potter and the Philosopher's Stone",
    "overview": "Harry Potter has lived under the stairs at his aunt and uncle's house his whole life. But on his 11th birthday, he learns he's a powerful wizard - with a place waiting for him at the Hogwarts School of Witchcraft and Wizardry. As he learns to harness his newfound powers with the help of the school's kindly headmaster, Harry uncovers the truth about his parents' deaths - and about the villain who's to blame.",
    "release_date": "2001-11-16"
  },
  {
    "id": 2,
    "title": "Harry Potter and the Chamber of Secrets",
    "overview": "Cars fly, trees fight back, and a mysterious house-elf comes to warn Harry Potter at the start of his second year at Hogwarts. Adventure and danger await when bloody writing on a wall announces: The Chamber Of Secrets Has Been Opened. To save Hogwarts will require all of Harry, Ron and Hermione’s magical abilities and courage.",
    "release_date": "2002-11-13"
  },
  {
    "id": 3,
    "title": "Harry Potter and the Prisoner of Azkaban",
    "overview": "Harry, Ron and Hermione return to Hogwarts for their third year. Harry comes face to face with danger yet again, this time in the form of escaped convict, Sirius Black — and turns to sympathetic Professor Lupin for help.",
    "release_date": "2004-05-31"
  },
  {
    "id": 4,
    "title": "Harry Potter and the Goblet of Fire",
    "overview": "Harry starts his fourth year at Hogwarts, competes in the treacherous Triwizard Tournament and faces the evil Lord Voldemort. Ron and Hermione help Harry manage the pressure – but Voldemort lurks, awaiting his chance to destroy Harry and all that he stands for.",
    "release_date": "2005-11-16"
  },
  {
    "id": 5,
    "title": "Harry Potter and the Order of the Phoenix",
    "overview": "Returning for his fifth year of study at Hogwarts, Harry is stunned to find that his warnings about the return of Lord Voldemort have been ignored. Left with no choice, Harry takes matters into his own hands, training a small group of students – dubbed 'Dumbledore's Army' – to defend themselves against the dark arts.",
    "release_date": "2007-06-28"
  },
  {
    "id": 6,
    "title": "Harry Potter and the Half-Blood Prince",
    "overview": "As Harry begins his sixth year at Hogwarts, he discovers an old book marked as 'Property of the Half-Blood Prince', and begins to learn more about Lord Voldemort's dark past.",
    "release_date": "2009-07-07"
  },
  {
    "id": 7,
    "title": "Harry Potter and the Deathly Hallows: Part 1",
    "overview": "Harry, Ron and Hermione walk away from their last year at Hogwarts to find and destroy the remaining Horcruxes, putting an end to Voldemort's bid for immortality. But with Harry's beloved Dumbledore dead and Voldemort's unscrupulous Death Eaters on the loose, the world is more dangerous than ever.",
    "release_date": "2010-10-17"
  },
  {
    "id": 8,
    "title": "Harry Potter and the Deathly Hallows: Part 2",
    "overview": "Harry, Ron and Hermione continue their quest to vanquish the evil Voldemort once and for all. Just as things begin to look hopeless for the young wizards, Harry discovers a trio of magical objects that endow him with powers to rival Voldemort's formidable skills.",
    "release_date": "2011-07-07"
  }
]